# GetNearestLevelId Method (Document, Double) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Level..::..GetNearestLevelId Method (Document, Double)
Level Class See Also
---
Returns id of the Level which is closest to the specified elevation.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public static ElementId GetNearestLevelId(
	Document document,
	double elevation
)
```

Visual Basic
---
```text
Public Shared Function GetNearestLevelId ( _
	document As Document, _
	elevation As Double _
) As ElementId
```

Visual C++
---
```text
public:
static ElementId^ GetNearestLevelId(
	Document^ document,
	double elevation
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document The document.
elevation
    Type: System..::..Double Target Elevation.
# Remarks
The level can be at, above or below the target elevation. If there is more than one Level at the same distance from the elevation, the Level with the lowest Id will be returned.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
Level Class
GetNearestLevelId Overload
Autodesk.Revit.DB Namespace